org/emacs_configurationv3.org
:PROPERTIES:
:ID:       B93391AC-9E77-46FF-BAFC-C344642557C9
:END:
#+SETUPFILE:~/.gclrc/org/hugo_setup.org
#+HUGO_SLUG: emacs_configurationv3
#+PROPERTY: header-args:js :exports both
#+PROPERTY: header-args :noweb no-export
xmeta
#+TITLE: Emacs ConfigurationV3
<badge: GCCLL | Homepage | green | / | gnu-emacs | tinder>

* key groups
** 常用按键

| key             | function                       |
|-----------------+--------------------------------|
| <f5>            | 退出emacs                      |
| %               | 跳到匹配的括号                 |
| M-w             | 复制                           |
|-----------------+--------------------------------|
| C-[78]          | lsp-bridge-jump[back]          |
| C-SPC           | 标记                           |
| C-,             | 跳到上次修改地方               |
| C-'"            | 关闭当前buffer                 |
| C-=             | expand-region                  |
| C-:             | 注释行                         |
| C-[/_?]         | undo, redo                     |
| C-[<>]          | 记忆和回跳                     |
| C-[ae]          | 行尾首                         |
| C-[sr]          | isearch                        |
| C-y             | 粘贴                           |
|-----------------+--------------------------------|
| M-2             | format-buffer                  |
| M-SPC           | 合并空格                       |
| M-"'[{(         | 包围字符串                     |
| M-)             | 取消包围                       |
| M-%             | 搜索替换                       |
| M-[78]          | select prev/next tab           |
| M-[<>JK]        | 滚动其它窗口                   |
| M-[-=]          | 数字+-1                        |
| M-[ae]          | 句子首尾                       |
| M-r             | 正则搜索                       |
| M-u             | vdiff-buffers                  |
| M-z             | 首字母大写                     |
| M-[NM]          | 删除前后单词                   |
| M-s [78]        | 选择第一或最后一个标签         |
|-----------------+--------------------------------|
| s-,             | 切换buffer                     |
| s-'             | eaf-open                       |
| ~s-[<>?]~       | ace 跳转，分别是word,char,line |
| s-h/n           | 切换/新建shell                 |
| s-o             | iedit                          |
| s-p             | 插入时间                       |
| s-u             | snails 搜索当前点              |
| s-y             | snails                         |
| s-R             | 可视化正则搜索                 |
| s-JK            | 光标不动，上下移动             |
| s-NP            | move-text                      |
| s-[-=]          | 字体大小                       |
| s-c o           | one-key 目录                   |
| ~s-x [,.fghjk]~ | color-rg 搜索                  |

** Fn

| key  | function            |
|------+---------------------|
| <f1> | woman帮助文档       |
| <f2> | auto refresh buffer |
| <f5> | 退出 emacs          |

** s-<key>, Option

| key      | function                        |
|----------+---------------------------------|
| ,        | 显示和隐藏buffer                |
| '        | eaf-open                        |
| \        | eaf-open-browswer               |
| ~/~      | eaf-open-terminal               |
| [        | 执行表达式                      |
| ~<>?~    | ace-jump-word/char/line         |
| b        | eaf-open-rss-reader             |
| f        | 使用root打开文件                |
| g        | goto-percent                    |
| h/n      | 切换/新建 shell                 |
| m        | 切换输入法                      |
| o        | iedit                           |
| p        | 插入标准时间2022-05-15 09:44:22 |
| r        | 打开samba                       |
| s        | org 文件                        |
| u        | snails-search-point             |
| y        | snails                          |
| R        | 可视化正则搜索                  |
| JK       | 光标位置不变，单行移动          |
| NP       | 将当前行移动(move-text-up/down) |
|----------+---------------------------------|
| 矩形操作 |                                 |
| D        | 删除                            |
| M        | 标记                            |
| X        | 对角交换                        |
| S        | 保存                            |
| Y        | 粘贴                            |
| O        | 用空白填充，并向右移动文本      |
| C        | 清空矩形                        |
| T        | 用字符串代替每一行              |
| I        | 在每一行插入字符串              |
| F        | 删除矩形中的空格                |
| "        | 拷贝到寄存器                    |
| :        | 标记矩形到行末                  |
| -=       | 字体变小/大                     |
|----------+---------------------------------|
*** s-c <key>

| key | function     |
|-----+--------------|
| o   | one-key 目录 |

*** s-x <key>

| key      | function       |
|----------+----------------|
| color-rg | search         |
| ,        | buffer symbol  |
| .        | buffer input   |
| f        | one-key 菜单   |
| g        | symbol         |
| h        | input          |
| j        | project symbol |
| k        | project input  |
| s-x      | 切换shell      |
|          |                |

