posts/emacs_configurationv3.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-05-15 Sun 21:47 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs ConfigurationV3</title>
<meta name="author" content="Zhicheng Lee" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/assets/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/assets/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="/assets/css/global.css"/>
<link rel="stylesheet" type="text/css" href="/assets/css/element-plus.css" />
<link rel="icon" type="image/png" sizes="48x48" href="/favicon.ico">
<link rel="stylesheet" href="/assets/js/fancybox/fancybox.css" type="text/css" media="screen" />
<meta name="category" content="emacs"/>
<meta name="tags" content="emacs"/>
<meta name="createdAt" content="2022-05-15 21:23:40"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs ConfigurationV3</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgca1395f">1. key groups</a>
<ul>
<li><a href="#orgeca9c38">1.1. 常用按键</a></li>
<li><a href="#orgeb8fc51">1.2. Fn</a></li>
<li><a href="#org39a6fe8">1.3. s-&lt;key&gt;, Option</a>
<ul>
<li><a href="#orgf02ca9d">1.3.1. s-c &lt;key&gt;</a></li>
<li><a href="#orgce949fb">1.3.2. s-x &lt;key&gt;</a></li>
</ul>
</li>
<li><a href="#orgdfeec8f">1.4. shift+数字键(单字符按键)</a></li>
<li><a href="#org583dd05">1.5. C-&lt;key&gt;, Control</a>
<ul>
<li><a href="#orge285551">1.5.1. C-c &lt;key&gt;</a></li>
<li><a href="#org03e0624">1.5.2. C-x &lt;key&gt;</a></li>
<li><a href="#org42dc1d6">1.5.3. C-z &lt;key&gt;</a></li>
<li><a href="#org602a66e">1.5.4. C-s-&lt;key&gt;</a></li>
<li><a href="#orgc2b54fe">1.5.5. C-S-&lt;key&gt;, Control-Shift</a></li>
<li><a href="#org95550b1">1.5.6. C-M-&lt;key&gt;</a></li>
</ul>
</li>
<li><a href="#org66685a9">1.6. M-&lt;key&gt;, Command</a>
<ul>
<li><a href="#orgb5d3848">1.6.1. M-s-&lt;key&gt;, Command-Option</a></li>
</ul>
</li>
<li><a href="#orgf5e05c3">1.7. projectile-ruby</a></li>
<li><a href="#org8bc7fcb">1.8. Ido文件管理器</a></li>
<li><a href="#orgea65fa4">1.9. 多标签操作</a></li>
<li><a href="#orgc5808e1">1.10. EAF</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
&lt;badge: GCCLL | Homepage | green | / | gnu-emacs | tinder&gt;
</p>

<div id="outline-container-orgca1395f" class="outline-2">
<h2 id="orgca1395f"><span class="section-number-2">1.</span> key groups</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgeca9c38" class="outline-3">
<h3 id="orgeca9c38"><span class="section-number-3">1.1.</span> 常用按键</h3>
<div class="outline-text-3" id="text-1-1">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&lt;f5&gt;</td>
<td class="org-left">退出emacs</td>
</tr>

<tr>
<td class="org-left">%</td>
<td class="org-left">跳到匹配的括号</td>
</tr>

<tr>
<td class="org-left">M-w</td>
<td class="org-left">复制</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">C-[78]</td>
<td class="org-left">lsp-bridge-jump[back]</td>
</tr>

<tr>
<td class="org-left">C-SPC</td>
<td class="org-left">标记</td>
</tr>

<tr>
<td class="org-left">C-,</td>
<td class="org-left">跳到上次修改地方</td>
</tr>

<tr>
<td class="org-left">C-'"</td>
<td class="org-left">关闭当前buffer</td>
</tr>

<tr>
<td class="org-left">C-=</td>
<td class="org-left">expand-region</td>
</tr>

<tr>
<td class="org-left">C-:</td>
<td class="org-left">注释行</td>
</tr>

<tr>
<td class="org-left">C-[/_?]</td>
<td class="org-left">undo, redo</td>
</tr>

<tr>
<td class="org-left">C-[&lt;&gt;]</td>
<td class="org-left">记忆和回跳</td>
</tr>

<tr>
<td class="org-left">C-[ae]</td>
<td class="org-left">行尾首</td>
</tr>

<tr>
<td class="org-left">C-[sr]</td>
<td class="org-left">isearch</td>
</tr>

<tr>
<td class="org-left">C-y</td>
<td class="org-left">粘贴</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">M-2</td>
<td class="org-left">format-buffer</td>
</tr>

<tr>
<td class="org-left">M-SPC</td>
<td class="org-left">合并空格</td>
</tr>

<tr>
<td class="org-left">M-"'[{(</td>
<td class="org-left">包围字符串</td>
</tr>

<tr>
<td class="org-left">M-)</td>
<td class="org-left">取消包围</td>
</tr>

<tr>
<td class="org-left">M-%</td>
<td class="org-left">搜索替换</td>
</tr>

<tr>
<td class="org-left">M-[78]</td>
<td class="org-left">select prev/next tab</td>
</tr>

<tr>
<td class="org-left">M-[&lt;&gt;JK]</td>
<td class="org-left">滚动其它窗口</td>
</tr>

<tr>
<td class="org-left">M-[-=]</td>
<td class="org-left">数字+-1</td>
</tr>

<tr>
<td class="org-left">M-[ae]</td>
<td class="org-left">句子首尾</td>
</tr>

<tr>
<td class="org-left">M-r</td>
<td class="org-left">正则搜索</td>
</tr>

<tr>
<td class="org-left">M-u</td>
<td class="org-left">vdiff-buffers</td>
</tr>

<tr>
<td class="org-left">M-z</td>
<td class="org-left">首字母大写</td>
</tr>

<tr>
<td class="org-left">M-[NM]</td>
<td class="org-left">删除前后单词</td>
</tr>

<tr>
<td class="org-left">M-s [78]</td>
<td class="org-left">选择第一或最后一个标签</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">s-,</td>
<td class="org-left">切换buffer</td>
</tr>

<tr>
<td class="org-left">s-'</td>
<td class="org-left">eaf-open</td>
</tr>

<tr>
<td class="org-left"><code>s-[&lt;&gt;?]</code></td>
<td class="org-left">ace 跳转，分别是word,char,line</td>
</tr>

<tr>
<td class="org-left">s-h/n</td>
<td class="org-left">切换/新建shell</td>
</tr>

<tr>
<td class="org-left">s-o</td>
<td class="org-left">iedit</td>
</tr>

<tr>
<td class="org-left">s-p</td>
<td class="org-left">插入时间</td>
</tr>

<tr>
<td class="org-left">s-u</td>
<td class="org-left">snails 搜索当前点</td>
</tr>

<tr>
<td class="org-left">s-y</td>
<td class="org-left">snails</td>
</tr>

<tr>
<td class="org-left">s-R</td>
<td class="org-left">可视化正则搜索</td>
</tr>

<tr>
<td class="org-left">s-JK</td>
<td class="org-left">光标不动，上下移动</td>
</tr>

<tr>
<td class="org-left">s-NP</td>
<td class="org-left">move-text</td>
</tr>

<tr>
<td class="org-left">s-[-=]</td>
<td class="org-left">字体大小</td>
</tr>

<tr>
<td class="org-left">s-c o</td>
<td class="org-left">one-key 目录</td>
</tr>

<tr>
<td class="org-left"><code>s-x [,.fghjk]</code></td>
<td class="org-left">color-rg 搜索</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgeb8fc51" class="outline-3">
<h3 id="orgeb8fc51"><span class="section-number-3">1.2.</span> Fn</h3>
<div class="outline-text-3" id="text-1-2">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&lt;f1&gt;</td>
<td class="org-left">woman帮助文档</td>
</tr>

<tr>
<td class="org-left">&lt;f2&gt;</td>
<td class="org-left">auto refresh buffer</td>
</tr>

<tr>
<td class="org-left">&lt;f5&gt;</td>
<td class="org-left">退出 emacs</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org39a6fe8" class="outline-3">
<h3 id="org39a6fe8"><span class="section-number-3">1.3.</span> s-&lt;key&gt;, Option</h3>
<div class="outline-text-3" id="text-1-3">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">,</td>
<td class="org-left">显示和隐藏buffer</td>
</tr>

<tr>
<td class="org-left">'</td>
<td class="org-left">eaf-open</td>
</tr>

<tr>
<td class="org-left">\</td>
<td class="org-left">eaf-open-browswer</td>
</tr>

<tr>
<td class="org-left"><code>/</code></td>
<td class="org-left">eaf-open-terminal</td>
</tr>

<tr>
<td class="org-left">[</td>
<td class="org-left">执行表达式</td>
</tr>

<tr>
<td class="org-left"><code>&lt;&gt;?</code></td>
<td class="org-left">ace-jump-word/char/line</td>
</tr>

<tr>
<td class="org-left">b</td>
<td class="org-left">eaf-open-rss-reader</td>
</tr>

<tr>
<td class="org-left">f</td>
<td class="org-left">使用root打开文件</td>
</tr>

<tr>
<td class="org-left">g</td>
<td class="org-left">goto-percent</td>
</tr>

<tr>
<td class="org-left">h/n</td>
<td class="org-left">切换/新建 shell</td>
</tr>

<tr>
<td class="org-left">m</td>
<td class="org-left">切换输入法</td>
</tr>

<tr>
<td class="org-left">o</td>
<td class="org-left">iedit</td>
</tr>

<tr>
<td class="org-left">p</td>
<td class="org-left">插入标准时间2022-05-15 09:44:22</td>
</tr>

<tr>
<td class="org-left">r</td>
<td class="org-left">打开samba</td>
</tr>

<tr>
<td class="org-left">s</td>
<td class="org-left">org 文件</td>
</tr>

<tr>
<td class="org-left">u</td>
<td class="org-left">snails-search-point</td>
</tr>

<tr>
<td class="org-left">y</td>
<td class="org-left">snails</td>
</tr>

<tr>
<td class="org-left">R</td>
<td class="org-left">可视化正则搜索</td>
</tr>

<tr>
<td class="org-left">JK</td>
<td class="org-left">光标位置不变，单行移动</td>
</tr>

<tr>
<td class="org-left">NP</td>
<td class="org-left">将当前行移动(move-text-up/down)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">矩形操作</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">D</td>
<td class="org-left">删除</td>
</tr>

<tr>
<td class="org-left">M</td>
<td class="org-left">标记</td>
</tr>

<tr>
<td class="org-left">X</td>
<td class="org-left">对角交换</td>
</tr>

<tr>
<td class="org-left">S</td>
<td class="org-left">保存</td>
</tr>

<tr>
<td class="org-left">Y</td>
<td class="org-left">粘贴</td>
</tr>

<tr>
<td class="org-left">O</td>
<td class="org-left">用空白填充，并向右移动文本</td>
</tr>

<tr>
<td class="org-left">C</td>
<td class="org-left">清空矩形</td>
</tr>

<tr>
<td class="org-left">T</td>
<td class="org-left">用字符串代替每一行</td>
</tr>

<tr>
<td class="org-left">I</td>
<td class="org-left">在每一行插入字符串</td>
</tr>

<tr>
<td class="org-left">F</td>
<td class="org-left">删除矩形中的空格</td>
</tr>

<tr>
<td class="org-left">"</td>
<td class="org-left">拷贝到寄存器</td>
</tr>

<tr>
<td class="org-left">:</td>
<td class="org-left">标记矩形到行末</td>
</tr>

<tr>
<td class="org-left">-=</td>
<td class="org-left">字体变小/大</td>
</tr>
</tbody>
</table>
</div>
