org/emacs_configurationv3.org
** shift+数字键(单字符按键)

| key   | function              |
|-------+-----------------------|
| ~%~   | jump to matched paren |
| <DEL> | 往回删除一个单词      |
|       |                       |

** C-<key>, Control

| key   | function                           |
|-------+------------------------------------|
| 4     | 插入日志时间                       |
| 78    | lsp-bridge-jump[back]              |
| <SPC> | 标记                               |
| ,     | 跳到上次修改的地方                 |
| '     | 关闭当前buffer并关闭窗口           |
| "     | 删除当前buffer的窗口               |
| -     | 递归搜索引用(编程)                         |
| =     | expand-region                      |
| :     | 注释当前行                         |
| &     | 跳到 *Message* buffer              |
| /_    | undo 撤销                          |
| ?     | redo 回退                          |
| ><    | 记忆函数位置和回跳                 |
| ae    | 行首行尾                           |
| bfnp  | 移动一个字符或行                   |
| d     | 删除光标右边的字符                 |
| j     | 向父节点移动(如：编程时嵌套的函数) |
| k     | 删除光标后行内容                   |
| ol    | 在上(o)或下(l)新空行               |
| g     | 中止Isearch搜索                    |
| s/r   | Isearch                            |
| wy    | 粘贴光标后的字符或行作为搜索对象   |
| v     | scroll down                        |
| w     | 删除选中内容                       |
*** C-c <key>

| key | function     |
|-----+--------------|
| r   | org-remenber |
|     |              |
*** C-x <key>

| key    | function                 |
|--------+--------------------------|
| 0      | 关闭窗口                 |
| 1      | delete other window      |
| 2      | split horizontally       |
| 3      | split vertically         |
| 5 [20] | 新建/删除frame           |
| ;      | 关闭其它窗口             |
| f      | fill-columns, ~M-q~ 生效 |
| u      | 选中当前行               |
| b      | 切换buffer               |
| s      | 保存其它buffers          |
| vh     | 纵/横向分割窗口          |
| y      | dash-at-point            |
| C-b    | 列出所有buffers          |
| C-f    | 查找文件                 |
| C-s    | 保存                     |
| C-x    | 标记和切换               |


*** C-z <key>
| key   | function               |
|-------+------------------------|
| ;     | popweb-dict-bing-input |
| j     | 跳到文件尾             |
| k     | 跳到文件头             |
| l     | 开启/关闭行号显示      |
| y     | popweb-dict-bing-point |
*** C-s-<key>

| key        | function                                                |
|------------+---------------------------------------------------------|
| pn         | move and comment up/down line                           |
|            |                                                         |
*** C-S-<key>, Control-Shift

| key  | function                           |
|------+------------------------------------|
| j    | jump-to-import(python-mode)        |
| ol   | 复制当前行到上面或下面             |
| s-ol | 复制当前行到上面或下面且注释当前行 |

*** C-M-<key>

| key   | function                                                |
|-------+---------------------------------------------------------|
| ;     | 关闭其它窗口的buffer                                    |
| %     | 正则替换                                                |
| ae    | 跳到函数开头和结束                                      |
| fb    | 按段落移动                                              |
| youi  | jump into/out LIST, yo:left/right out, ui:left/right in |
| v     | 滚动其它窗口                                            |
|       |                                                         |

