posts/emacs_configurationv3.html
<div id="outline-container-orgf02ca9d" class="outline-4">
<h4 id="orgf02ca9d"><span class="section-number-4">1.3.1.</span> s-c &lt;key&gt;</h4>
<div class="outline-text-4" id="text-1-3-1">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">o</td>
<td class="org-left">one-key 目录</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgce949fb" class="outline-4">
<h4 id="orgce949fb"><span class="section-number-4">1.3.2.</span> s-x &lt;key&gt;</h4>
<div class="outline-text-4" id="text-1-3-2">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">color-rg</td>
<td class="org-left">search</td>
</tr>

<tr>
<td class="org-left">,</td>
<td class="org-left">buffer symbol</td>
</tr>

<tr>
<td class="org-left">.</td>
<td class="org-left">buffer input</td>
</tr>

<tr>
<td class="org-left">f</td>
<td class="org-left">one-key 菜单</td>
</tr>

<tr>
<td class="org-left">g</td>
<td class="org-left">symbol</td>
</tr>

<tr>
<td class="org-left">h</td>
<td class="org-left">input</td>
</tr>

<tr>
<td class="org-left">j</td>
<td class="org-left">project symbol</td>
</tr>

<tr>
<td class="org-left">k</td>
<td class="org-left">project input</td>
</tr>

<tr>
<td class="org-left">s-x</td>
<td class="org-left">切换shell</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgdfeec8f" class="outline-3">
<h3 id="orgdfeec8f"><span class="section-number-3">1.4.</span> shift+数字键(单字符按键)</h3>
<div class="outline-text-3" id="text-1-4">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>%</code></td>
<td class="org-left">jump to matched paren</td>
</tr>

<tr>
<td class="org-left">&lt;DEL&gt;</td>
<td class="org-left">往回删除一个单词</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org583dd05" class="outline-3">
<h3 id="org583dd05"><span class="section-number-3">1.5.</span> C-&lt;key&gt;, Control</h3>
<div class="outline-text-3" id="text-1-5">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">4</td>
<td class="org-left">插入日志时间</td>
</tr>

<tr>
<td class="org-left">78</td>
<td class="org-left">lsp-bridge-jump[back]</td>
</tr>

<tr>
<td class="org-left">&lt;SPC&gt;</td>
<td class="org-left">标记</td>
</tr>

<tr>
<td class="org-left">,</td>
<td class="org-left">跳到上次修改的地方</td>
</tr>

<tr>
<td class="org-left">'</td>
<td class="org-left">关闭当前buffer并关闭窗口</td>
</tr>

<tr>
<td class="org-left">"</td>
<td class="org-left">删除当前buffer的窗口</td>
</tr>

<tr>
<td class="org-left">-</td>
<td class="org-left">递归搜索引用(编程)</td>
</tr>

<tr>
<td class="org-left">=</td>
<td class="org-left">expand-region</td>
</tr>

<tr>
<td class="org-left">:</td>
<td class="org-left">注释当前行</td>
</tr>

<tr>
<td class="org-left">&amp;</td>
<td class="org-left">跳到 <b>Message</b> buffer</td>
</tr>

<tr>
<td class="org-left">/_</td>
<td class="org-left">undo 撤销</td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-left">redo 回退</td>
</tr>

<tr>
<td class="org-left">&gt;&lt;</td>
<td class="org-left">记忆函数位置和回跳</td>
</tr>

<tr>
<td class="org-left">ae</td>
<td class="org-left">行首行尾</td>
</tr>

<tr>
<td class="org-left">bfnp</td>
<td class="org-left">移动一个字符或行</td>
</tr>

<tr>
<td class="org-left">d</td>
<td class="org-left">删除光标右边的字符</td>
</tr>

<tr>
<td class="org-left">j</td>
<td class="org-left">向父节点移动(如：编程时嵌套的函数)</td>
</tr>

<tr>
<td class="org-left">k</td>
<td class="org-left">删除光标后行内容</td>
</tr>

<tr>
<td class="org-left">ol</td>
<td class="org-left">在上(o)或下(l)新空行</td>
</tr>

<tr>
<td class="org-left">g</td>
<td class="org-left">中止Isearch搜索</td>
</tr>

<tr>
<td class="org-left">s/r</td>
<td class="org-left">Isearch</td>
</tr>

<tr>
<td class="org-left">wy</td>
<td class="org-left">粘贴光标后的字符或行作为搜索对象</td>
</tr>

<tr>
<td class="org-left">v</td>
<td class="org-left">scroll down</td>
</tr>

<tr>
<td class="org-left">w</td>
<td class="org-left">删除选中内容</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-orge285551" class="outline-4">
<h4 id="orge285551"><span class="section-number-4">1.5.1.</span> C-c &lt;key&gt;</h4>
<div class="outline-text-4" id="text-1-5-1">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">r</td>
<td class="org-left">org-remenber</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org03e0624" class="outline-4">
<h4 id="org03e0624"><span class="section-number-4">1.5.2.</span> C-x &lt;key&gt;</h4>
<div class="outline-text-4" id="text-1-5-2">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">0</td>
<td class="org-left">关闭窗口</td>
</tr>

<tr>
<td class="org-left">1</td>
<td class="org-left">delete other window</td>
</tr>

<tr>
<td class="org-left">2</td>
<td class="org-left">split horizontally</td>
</tr>

<tr>
<td class="org-left">3</td>
<td class="org-left">split vertically</td>
</tr>

<tr>
<td class="org-left">5 [20]</td>
<td class="org-left">新建/删除frame</td>
</tr>

<tr>
<td class="org-left">;</td>
<td class="org-left">关闭其它窗口</td>
</tr>

<tr>
<td class="org-left">f</td>
<td class="org-left">fill-columns, <code>M-q</code> 生效</td>
</tr>

<tr>
<td class="org-left">u</td>
<td class="org-left">选中当前行</td>
</tr>

<tr>
<td class="org-left">b</td>
<td class="org-left">切换buffer</td>
</tr>

<tr>
<td class="org-left">s</td>
<td class="org-left">保存其它buffers</td>
</tr>

<tr>
<td class="org-left">vh</td>
<td class="org-left">纵/横向分割窗口</td>
</tr>

<tr>
<td class="org-left">y</td>
<td class="org-left">dash-at-point</td>
</tr>

<tr>
<td class="org-left">C-b</td>
<td class="org-left">列出所有buffers</td>
</tr>

<tr>
<td class="org-left">C-f</td>
<td class="org-left">查找文件</td>
</tr>

<tr>
<td class="org-left">C-s</td>
<td class="org-left">保存</td>
</tr>

<tr>
<td class="org-left">C-x</td>
<td class="org-left">标记和切换</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org42dc1d6" class="outline-4">
<h4 id="org42dc1d6"><span class="section-number-4">1.5.3.</span> C-z &lt;key&gt;</h4>
<div class="outline-text-4" id="text-1-5-3">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">;</td>
<td class="org-left">popweb-dict-bing-input</td>
</tr>

<tr>
<td class="org-left">j</td>
<td class="org-left">跳到文件尾</td>
</tr>

<tr>
<td class="org-left">k</td>
<td class="org-left">跳到文件头</td>
</tr>

<tr>
<td class="org-left">l</td>
<td class="org-left">开启/关闭行号显示</td>
</tr>

<tr>
<td class="org-left">y</td>
<td class="org-left">popweb-dict-bing-point</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org602a66e" class="outline-4">
<h4 id="org602a66e"><span class="section-number-4">1.5.4.</span> C-s-&lt;key&gt;</h4>
<div class="outline-text-4" id="text-1-5-4">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">pn</td>
<td class="org-left">move and comment up/down line</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgc2b54fe" class="outline-4">
<h4 id="orgc2b54fe"><span class="section-number-4">1.5.5.</span> C-S-&lt;key&gt;, Control-Shift</h4>
<div class="outline-text-4" id="text-1-5-5">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">j</td>
<td class="org-left">jump-to-import(python-mode)</td>
</tr>

<tr>
<td class="org-left">ol</td>
<td class="org-left">复制当前行到上面或下面</td>
</tr>

<tr>
<td class="org-left">s-ol</td>
<td class="org-left">复制当前行到上面或下面且注释当前行</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org95550b1" class="outline-4">
<h4 id="org95550b1"><span class="section-number-4">1.5.6.</span> C-M-&lt;key&gt;</h4>
<div class="outline-text-4" id="text-1-5-6">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">;</td>
<td class="org-left">关闭其它窗口的buffer</td>
</tr>

<tr>
<td class="org-left">%</td>
<td class="org-left">正则替换</td>
</tr>

<tr>
<td class="org-left">ae</td>
<td class="org-left">跳到函数开头和结束</td>
</tr>

<tr>
<td class="org-left">fb</td>
<td class="org-left">按段落移动</td>
</tr>

<tr>
<td class="org-left">youi</td>
<td class="org-left">jump into/out LIST, yo:left/right out, ui:left/right in</td>
</tr>

<tr>
<td class="org-left">v</td>
<td class="org-left">滚动其它窗口</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
