org/emacs_configurationv3.org
** M-<key>, Command

| key    | function                                            |
|--------+-----------------------------------------------------|
| 2      | 自动格式化buffer                                    |
| 78     | 选择前/后一个标签                                   |
| ~<>~   | 滚动其它窗口(Isearch跳到文件尾/头重新搜索)          |
| -=     | 光标处的数字+-1                                     |
| <DEL>  | 删除光标后的一个单词                                |
| <SPC>  | 合并空格                                            |
| "'[{(  | 包围当前字符串(加括号)                              |
| )      | 去掉当前包围符号(去括号)                            |
| :      | 跳出括号并换行                                      |
| %      | 搜索替换                                            |
| ~<>KJ~ | 滚动其它窗口                                        |
| a      | 跳到句子开头                                        |
| e      | 跳到句子结尾(Isearch中编辑搜索对象)                 |
| c      | 特定模式切换buffer                                  |
| d      | 删除光标前的一个单词(ISearch重复查找单词)           |
| b      | 单词移动                                            |
| h/H    | 同 =C-SPC=，方便输入法时标记                        |
| j      | 用 eaf 打开文件管理器                                       |
| k      | 删除光标后的语句                                    |
| gG     | 跳到指定的列或行                                    |
| o      | 删除光标后的字符                                    |
| pn     | 左右移到，根据当前开发语言关键词(ISearch中切换历史) |
| r      | 切换正则搜索(ISearch)                               |
| s      | symbol-overlay-put, 标记颜色                        |
| v      | scroll up                                           |
| z      | 首字母大写                                          |
| I      | 往后跳4个字符                                       |
| NM     | 删除前后的单词                                      |
|        |                                                     |

*** M-s-<key>, Command-Option

| key         | function                      |
|-------------+-------------------------------|
| 78          | 选择第一个或最后一个标签      |
| .,          | 标记Buffer和回跳              |
| h           | thing-edit one-key 菜单       |
| i           | ielm                          |
| jk          | 显示flycheck上/下一个错误     |
| o           | 切换一个窗口，临时最大化/还原 |
| pn          | move comment up/down          |
| y           | kill-ring 搜索                |
| ~sdcweavfq~ | 键盘宏                        |
| u           | vdiff-buffers                 |
|             |                               |
** projectile-ruby

| key | function           |
|-----+--------------------|
| f   | Ruby file          |
| d   | file DWIM          |
| r   | Routes             |
| g   | Gemfile            |
| t   | template           |
| j   | visit javascript   |
| s   | Seeds              |
| h   | Helper             |
| v   | Current View       |
| c   | current controller |
| m   | current model      |
| V   | view               |
| C   | controller         |
| M   | Model              |
| k   | kill buffers       |
| p   | Grep Project       |
| P   | visit project      |
** Ido文件管理器

| key         | function          |
|-------------+-------------------|
| Ido文件管理 |                   |
| M-s-p/n     | 上下匹配          |
| M-s-h/l     | 上/下一个工作目录 |
| C-x i       | 插入缓存          |
| C-x I       | 插入文件          |
| M-[oO]      | -                 |
|             |                   |
** 多标签操作

| key      | function                 |
|----------+--------------------------|
| M-[78]   | 选择前/后一个标签        |
| M-s-[78] | 选择第一个或最后一个标签 |
| C-;      | 关闭当前标签             |
| s-q      | 关闭特定模式标签         |
| S-Q      | 关闭所有标签             |

** EAF

| key | function              |
|-----+-----------------------|
| M-j | 用 eaf 打开文件管理器 |
| s-' | eaf-open              |
| s-\ | eaf-open-browser      |
| s-/ | eaf-open-terminal     |
| s-b | eaf-open-rss-reader   |




* COMMENT Local Variables       :ARCHIVE:
# Local Variables:
# after-save-hook: gcl/org-html-export-to-html
# End:
