posts/emacs_configurationv3.html

<div id="outline-container-org66685a9" class="outline-3">
<h3 id="org66685a9"><span class="section-number-3">1.6.</span> M-&lt;key&gt;, Command</h3>
<div class="outline-text-3" id="text-1-6">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">2</td>
<td class="org-left">自动格式化buffer</td>
</tr>

<tr>
<td class="org-left">78</td>
<td class="org-left">选择前/后一个标签</td>
</tr>

<tr>
<td class="org-left"><code>&lt;&gt;</code></td>
<td class="org-left">滚动其它窗口(Isearch跳到文件尾/头重新搜索)</td>
</tr>

<tr>
<td class="org-left">-=</td>
<td class="org-left">光标处的数字+-1</td>
</tr>

<tr>
<td class="org-left">&lt;DEL&gt;</td>
<td class="org-left">删除光标后的一个单词</td>
</tr>

<tr>
<td class="org-left">&lt;SPC&gt;</td>
<td class="org-left">合并空格</td>
</tr>

<tr>
<td class="org-left">"'[{(</td>
<td class="org-left">包围当前字符串(加括号)</td>
</tr>

<tr>
<td class="org-left">)</td>
<td class="org-left">去掉当前包围符号(去括号)</td>
</tr>

<tr>
<td class="org-left">:</td>
<td class="org-left">跳出括号并换行</td>
</tr>

<tr>
<td class="org-left">%</td>
<td class="org-left">搜索替换</td>
</tr>

<tr>
<td class="org-left"><code>&lt;&gt;KJ</code></td>
<td class="org-left">滚动其它窗口</td>
</tr>

<tr>
<td class="org-left">a</td>
<td class="org-left">跳到句子开头</td>
</tr>

<tr>
<td class="org-left">e</td>
<td class="org-left">跳到句子结尾(Isearch中编辑搜索对象)</td>
</tr>

<tr>
<td class="org-left">c</td>
<td class="org-left">特定模式切换buffer</td>
</tr>

<tr>
<td class="org-left">d</td>
<td class="org-left">删除光标前的一个单词(ISearch重复查找单词)</td>
</tr>

<tr>
<td class="org-left">b</td>
<td class="org-left">单词移动</td>
</tr>

<tr>
<td class="org-left">h/H</td>
<td class="org-left">同 =C-SPC=，方便输入法时标记</td>
</tr>

<tr>
<td class="org-left">j</td>
<td class="org-left">用 eaf 打开文件管理器</td>
</tr>

<tr>
<td class="org-left">k</td>
<td class="org-left">删除光标后的语句</td>
</tr>

<tr>
<td class="org-left">gG</td>
<td class="org-left">跳到指定的列或行</td>
</tr>

<tr>
<td class="org-left">o</td>
<td class="org-left">删除光标后的字符</td>
</tr>

<tr>
<td class="org-left">pn</td>
<td class="org-left">左右移到，根据当前开发语言关键词(ISearch中切换历史)</td>
</tr>

<tr>
<td class="org-left">r</td>
<td class="org-left">切换正则搜索(ISearch)</td>
</tr>

<tr>
<td class="org-left">s</td>
<td class="org-left">symbol-overlay-put, 标记颜色</td>
</tr>

<tr>
<td class="org-left">v</td>
<td class="org-left">scroll up</td>
</tr>

<tr>
<td class="org-left">z</td>
<td class="org-left">首字母大写</td>
</tr>

<tr>
<td class="org-left">I</td>
<td class="org-left">往后跳4个字符</td>
</tr>

<tr>
<td class="org-left">NM</td>
<td class="org-left">删除前后的单词</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orgb5d3848" class="outline-4">
<h4 id="orgb5d3848"><span class="section-number-4">1.6.1.</span> M-s-&lt;key&gt;, Command-Option</h4>
<div class="outline-text-4" id="text-1-6-1">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">78</td>
<td class="org-left">选择第一个或最后一个标签</td>
</tr>

<tr>
<td class="org-left">.,</td>
<td class="org-left">标记Buffer和回跳</td>
</tr>

<tr>
<td class="org-left">h</td>
<td class="org-left">thing-edit one-key 菜单</td>
</tr>

<tr>
<td class="org-left">i</td>
<td class="org-left">ielm</td>
</tr>

<tr>
<td class="org-left">jk</td>
<td class="org-left">显示flycheck上/下一个错误</td>
</tr>

<tr>
<td class="org-left">o</td>
<td class="org-left">切换一个窗口，临时最大化/还原</td>
</tr>

<tr>
<td class="org-left">pn</td>
<td class="org-left">move comment up/down</td>
</tr>

<tr>
<td class="org-left">y</td>
<td class="org-left">kill-ring 搜索</td>
</tr>

<tr>
<td class="org-left"><code>sdcweavfq</code></td>
<td class="org-left">键盘宏</td>
</tr>

<tr>
<td class="org-left">u</td>
<td class="org-left">vdiff-buffers</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orgf5e05c3" class="outline-3">
<h3 id="orgf5e05c3"><span class="section-number-3">1.7.</span> projectile-ruby</h3>
<div class="outline-text-3" id="text-1-7">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">f</td>
<td class="org-left">Ruby file</td>
</tr>

<tr>
<td class="org-left">d</td>
<td class="org-left">file DWIM</td>
</tr>

<tr>
<td class="org-left">r</td>
<td class="org-left">Routes</td>
</tr>

<tr>
<td class="org-left">g</td>
<td class="org-left">Gemfile</td>
</tr>

<tr>
<td class="org-left">t</td>
<td class="org-left">template</td>
</tr>

<tr>
<td class="org-left">j</td>
<td class="org-left">visit javascript</td>
</tr>

<tr>
<td class="org-left">s</td>
<td class="org-left">Seeds</td>
</tr>

<tr>
<td class="org-left">h</td>
<td class="org-left">Helper</td>
</tr>

<tr>
<td class="org-left">v</td>
<td class="org-left">Current View</td>
</tr>

<tr>
<td class="org-left">c</td>
<td class="org-left">current controller</td>
</tr>

<tr>
<td class="org-left">m</td>
<td class="org-left">current model</td>
</tr>

<tr>
<td class="org-left">V</td>
<td class="org-left">view</td>
</tr>

<tr>
<td class="org-left">C</td>
<td class="org-left">controller</td>
</tr>

<tr>
<td class="org-left">M</td>
<td class="org-left">Model</td>
</tr>

<tr>
<td class="org-left">k</td>
<td class="org-left">kill buffers</td>
</tr>

<tr>
<td class="org-left">p</td>
<td class="org-left">Grep Project</td>
</tr>

<tr>
<td class="org-left">P</td>
<td class="org-left">visit project</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org8bc7fcb" class="outline-3">
<h3 id="org8bc7fcb"><span class="section-number-3">1.8.</span> Ido文件管理器</h3>
<div class="outline-text-3" id="text-1-8">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Ido文件管理</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">M-s-p/n</td>
<td class="org-left">上下匹配</td>
</tr>

<tr>
<td class="org-left">M-s-h/l</td>
<td class="org-left">上/下一个工作目录</td>
</tr>

<tr>
<td class="org-left">C-x i</td>
<td class="org-left">插入缓存</td>
</tr>

<tr>
<td class="org-left">C-x I</td>
<td class="org-left">插入文件</td>
</tr>

<tr>
<td class="org-left">M-[oO]</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgea65fa4" class="outline-3">
<h3 id="orgea65fa4"><span class="section-number-3">1.9.</span> 多标签操作</h3>
<div class="outline-text-3" id="text-1-9">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">M-[78]</td>
<td class="org-left">选择前/后一个标签</td>
</tr>

<tr>
<td class="org-left">M-s-[78]</td>
<td class="org-left">选择第一个或最后一个标签</td>
</tr>

<tr>
<td class="org-left">C-;</td>
<td class="org-left">关闭当前标签</td>
</tr>

<tr>
<td class="org-left">s-q</td>
<td class="org-left">关闭特定模式标签</td>
</tr>

<tr>
<td class="org-left">S-Q</td>
<td class="org-left">关闭所有标签</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc5808e1" class="outline-3">
<h3 id="orgc5808e1"><span class="section-number-3">1.10.</span> EAF</h3>
<div class="outline-text-3" id="text-1-10">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">M-j</td>
<td class="org-left">用 eaf 打开文件管理器</td>
</tr>

<tr>
<td class="org-left">s-'</td>
<td class="org-left">eaf-open</td>
</tr>

<tr>
<td class="org-left">s-\</td>
<td class="org-left">eaf-open-browser</td>
</tr>

<tr>
<td class="org-left">s-/</td>
<td class="org-left">eaf-open-terminal</td>
</tr>

<tr>
<td class="org-left">s-b</td>
<td class="org-left">eaf-open-rss-reader</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Zhicheng Lee</p>
<p class="date">Created: 2022-05-15 Sun 21:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
